#### Terraform Plan 📖``
#### Terraform Validation 🤖``

<details><summary>Show Plan ()</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.stock_market_research_dataset will be created
  + resource "google_bigquery_dataset" "stock_market_research_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "stock_market_research"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = true
      + description                = "A dataset which will hold all the stock market research tables"
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + friendly_name              = "Stock market research"
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + max_time_travel_hours      = (known after apply)
      + project                    = "stock-market-research-410417"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access {
          + role          = "WRITER"
          + user_by_email = (known after apply)
        }
    }

  # google_bigquery_table.company_meta_data will be created
  + resource "google_bigquery_table" "company_meta_data" {
      + creation_time       = (known after apply)
      + dataset_id          = "stock_market_research"
      + deletion_protection = false
      + description         = "Holds data that describes a company - ticker symbol, market cap, country origin, sector, industry"
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + friendly_name       = "Company Meta Data"
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "stock-market-research-410417"
      + schema              = jsonencode(
            [
              + {
                  + description = "Also known as ticker - e.g. AAPL for Apple"
                  + mode        = "REQUIRED"
                  + name        = "symbol"
                  + type        = "STRING"
                },
              + {
                  + description = "Company name"
                  + mode        = "NULLABLE"
                  + name        = "name"
                  + type        = "STRING"
                },
              + {
                  + description = "The perceived value of the business by the market"
                  + mode        = "NULLABLE"
                  + name        = "market_cap"
                  + type        = "INTEGER"
                },
              + {
                  + description = "Country of origin"
                  + mode        = "NULLABLE"
                  + name        = "country"
                  + type        = "STRING"
                },
              + {
                  + description = "Year when the company stock became publicly offered"
                  + mode        = "NULLABLE"
                  + name        = "ipo_year"
                  + type        = "STRING"
                },
              + {
                  + description = "Stock trading volumes for a given point in time"
                  + mode        = "NULLABLE"
                  + name        = "volume"
                  + type        = "STRING"
                },
              + {
                  + description = "Market sector in which the company operates"
                  + mode        = "NULLABLE"
                  + name        = "sector"
                  + type        = "STRING"
                },
              + {
                  + description = "Market industry in which the company operates"
                  + mode        = "NULLABLE"
                  + name        = "industry"
                  + type        = "STRING"
                },
              + {
                  + description = "Market industry in which the company operates"
                  + mode        = "NULLABLE"
                  + name        = "industry"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "company_meta_data"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)
    }

  # google_service_account.stock_market_research_user will be created
  + resource "google_service_account" "stock_market_research_user" {
      + account_id   = "stock-market-research-user"
      + disabled     = false
      + display_name = "Stock market research user"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "stock-market-research-410417"
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tf.plan"

```

</details>

*Pushed by: @niki130396, Action: `pull_request`*